app/controllers/students_controller.rb

  def create
    @student = Student.create(students_params)
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2017-07-07 13:35:46.100117"], ["updated_at", "2017-07-07 13:35:46.100117"]]

  def update
    @student = Student.find(params[:id])
    @student.update!(students_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2017-07-07 13:55:23.600782"], ["id", 1]]